src/competitive-programming-problems.org
#+title: Competitive Programming Problems

* Array
** [[https://leetcode.com/problems/trapping-rain-water/description/][Trapping Rain Water @ leetcode]]

这道题目很有意思，我最先想到的一个办法是维护left, right两个数组，分别表示从i向左和向右的最高值。
时间和空间复杂度都是O(n), 代码简单易懂。

#+BEGIN_SRC Python
class Solution:
    def trap(self, height):
        """
        :type height: List[int]
        :rtype: int
        """
        n = len(height)
        if n == 0: return 0
        left = [0] * n
        right = [0] * n

        right[-1] = height[-1]
        for i in range(n - 2, -1, -1):
            right[i] = max(height[i], right[i + 1])
        left[0] = height[0]
        for i in range(1, n):
            left[i] = max(height[i], left[i - 1])

        ans = 0
        for i in range(n):
            ans += min(left[i], right[i]) - height[i]
        return ans
#+END_SRC

但是 [[https://leetcode.com/problems/trapping-rain-water/discuss/17527/My-Accepted-Java-Solution][thread]] 里面有个更好的办法，space是O(1). 想法和我的差不多，但是首先找到max_index,
然后分开两个部分计算。这样左边只需要维护left, 右边只需要维护right, 那么空间复杂度就可以降到O(1).

#+BEGIN_SRC Java
public int trap(int[] height) {
    if (height.length <= 2) return 0;
    int max = Integer.MIN_VALUE;
    int maxIndex = -1;
    for (int i = 0; i < height.length; i++) {
        if (height[i] > max) {
            max = height[i];
            maxIndex = i;
        }
    }

    int leftMax = height[0];
    int water = 0;
    for (int i = 1; i < maxIndex; i++) {
        if (height[i] > leftMax) {
            leftMax = height[i];
        } else {
            water += leftMax - height[i];
        }
    }

    int rightMax = height[height.length - 1];
    for (int i = height.length - 2; i > maxIndex; i--) {
        if (height[i] > rightMax) {
            rightMax = height[i];
        } else {
            water += rightMax - height[i];
        }
    }

    return water;
}
#+END_SRC

** [[https://leetcode.com/problems/sort-colors/description/][Sort Colors @ leetcode]]

这个题目就是三色旗排序问题，维护三个指针(left, right, now)分别表示存放0,2的位置以及当前位置。
终止条件是`now > right`

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution(object):
    def sortColors(self, nums):
        """
        :type nums: List[int]
        :rtype: void Do not return anything, modify nums in-place instead.
        """

        n = len(nums)
        x, y = 0, n - 1
        i = 0
        while i <= y:
            if nums[i] == 0:
                nums[x], nums[i] = nums[i], nums[x]
                assert nums[x] in (0, 1)
                x += 1
                i += 1 # 这里可以前移是因为掉过来的值只能是1，如果是2的话已经放在最右端了。
            elif nums[i] == 2:
                nums[y], nums[i] = nums[i], nums[y]
                y -= 1
            else:
                i += 1

#+END_SRC

** [[https://leetcode.com/problems/3sum/description/][3Sum @ leetcode]]

这题目的时间复杂度是O(n^2)没有太多问题，我觉得值得学习的地方是进行去重。当然可以首先获得所有可能的结果，然后统一进行去重，
但是那样效率比较低有额外的数据结构。更好的办法是在搜索的时候就进行去重，代码如下：（另外Python3是完全压线过去的，用C++重写不难）

#+BEGIN_SRC Python
class Solution(object):
    def threeSum(self, nums):
        """
        :type nums: List[int]
        :rtype: List[List[int]]
        """
        nums.sort()
        n = len(nums)
        ans = []

        for i in range(n):
            if i > 0 and nums[i] == nums[i - 1]: continue

            target = 0 - nums[i]
            j, k = i + 1, n - 1
            while j < k:
                value = nums[j] + nums[k]
                if value == target:
                    a, b, c = nums[i], nums[j], nums[k]
                    value = (a, b, c)
                    ans.append(value)
                    j += 1
                    k -= 1
                    while j < k and nums[j] == nums[j - 1]:
                        j += 1
                    while j < k and nums[k] == nums[k + 1]:
                        k -= 1
                elif value > target:
                    k -= 1
                    while j < k and nums[k] == nums[k + 1]:
                        k -= 1
                else:
                    j += 1
                    while j < k and nums[j] == nums[j - 1]:
                        j += 1
        return ans
#+END_SRC

** [[https://leetcode.com/problems/first-missing-positive/description/][First Missing Positive @ leetcode]]

pass1: 遍历所有的元素，将这些元素尽可能地放置到应该的位置。

pass2: 遍历归置好的数组，输出结果。

这个解法很有通用性。leetcode上还有一些题目也可以按照这个思路来解决 [[https://leetcode.com/problems/find-all-numbers-disappeared-in-an-array/description/][448. Find All Numbers Disappeared in an Array]] 和 [[https://leetcode.com/problems/find-all-duplicates-in-an-array/description/][442. Find All Duplicates in an Array]]

#+BEGIN_SRC Python
class Solution(object):
    def firstMissingPositive(self, nums):
        """
        :type nums: List[int]
        :rtype: int
        """

        n = len(nums)
        for i in range(n):
            x = nums[i]
            while 0 < x <= n and nums[x - 1] != x:
                nums[i], nums[x - 1] = nums[x - 1], nums[i]
                x = nums[i]

        print(nums)
        for i in range(n):
            x = nums[i]
            if (i + 1) != x:
                return i + 1
        return n + 1
#+END_SRC

