html/competitive-programming-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head><!-- Global site tag (gtag.js) - Google Analytics --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Competitive Programming Problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="maypeppa" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="/themes/styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="content">
<h1 class="title">Competitive Programming Problems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org570544e">1. Array</a>
<ul>
<li><a href="#org9f35c1a">1.1. Trapping Rain Water @ leetcode</a></li>
<li><a href="#orgecfaa49">1.2. Sort Colors @ leetcode</a></li>
<li><a href="#org817d50a">1.3. 3Sum @ leetcode</a></li>
<li><a href="#orga1642ac">1.4. First Missing Positive @ leetcode</a></li>
<li><a href="#orgd1202c7">1.5. Find All Numbers Disappeared in an Array @ leetcode</a></li>
<li><a href="#org8ffde8b">1.6. Shortest Unsorted Continuous Subarray @ leetcode</a></li>
<li><a href="#org878afed">1.7. Sum of Subarray Minimums @ leetcode</a></li>
<li><a href="#org3a27596">1.8. Image Overlap @ leetcode</a></li>
<li><a href="#org05d8c04">1.9. 792. Number of Matching Subsequences @ leetcode</a></li>
<li><a href="#org0fe04fc">1.10. 782. Transform to Chessboard @ leetcode</a></li>
<li><a href="#org0f9c5fd">1.11. 915. Partition Array into Disjoint Intervals @ leetcode</a></li>
<li><a href="#org951b960">1.12. 731. My Calendar II</a></li>
</ul>
</li>
<li><a href="#org8217648">2. Math</a>
<ul>
<li><a href="#orga3ea965">2.1. Poor Pigs @ leetcode</a></li>
<li><a href="#org1363317">2.2. Reconstruct Original Digits from English @ leetcode</a></li>
<li><a href="#orge226306">2.3. Sum of Subsequence Widths @ leetcode</a></li>
<li><a href="#org5f308b6">2.4. 279. Perfect Squares @ leetcode</a></li>
</ul>
</li>
<li><a href="#org18bfc84">3. DP</a>
<ul>
<li><a href="#org2ce97b7">3.1. NOIP2000方格取数</a></li>
<li><a href="#org3ae0e1b">3.2. Maximal Rectangle @ leetcode</a></li>
<li><a href="#orgd7154f1">3.3. Length of Longest Fibonacci Subsequence @ leetcode</a></li>
<li><a href="#orga4dbf46">3.4. Number of Subarrays with Bounded Maximum</a></li>
<li><a href="#org24ef474">3.5. 714. Best Time to Buy and Sell Stock with Transaction Fee @ leetcode</a></li>
<li><a href="#orgcabc2ea">3.6. 689. Maximum Sum of 3 Non-Overlapping Subarrays</a></li>
<li><a href="#org084f852">3.7. 97. Interleaving String</a></li>
<li><a href="#org6ee143e">3.8. 123. Best Time to Buy and Sell Stock III</a></li>
</ul>
</li>
<li><a href="#org5cb913a">4. BS</a>
<ul>
<li><a href="#orga0a8114">4.1. Find the Duplicate Number @ leetcode</a></li>
<li><a href="#orge2c4add">4.2. Median of Two Sorted Arrays @ leetcode</a></li>
<li><a href="#orga5c2bc2">4.3. 719. Find K-th Smallest Pair Distance @ leetcode</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org570544e" class="outline-2">
<h2 id="org570544e"><span class="section-number-2">1</span> Array</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9f35c1a" class="outline-3">
<h3 id="org9f35c1a"><span class="section-number-3">1.1</span> <a href="https://leetcode.com/problems/trapping-rain-water/description/">Trapping Rain Water @ leetcode</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
这道题目很有意思，我最先想到的一个办法是维护left, right两个数组，分别表示从i向左和向右的最高值。
时间和空间复杂度都是O(n), 代码简单易懂。
</p>

<div class="org-src-container">
<pre class="src src-Python">class Solution:
    def trap(self, height):
        """
        :type height: List[int]
        :rtype: int
        """
        n = len(height)
        if n == 0: return 0
        left = [0] * n
        right = [0] * n

        right[-1] = height[-1]
        for i in range(n - 2, -1, -1):
            right[i] = max(height[i], right[i + 1])
        left[0] = height[0]
        for i in range(1, n):
            left[i] = max(height[i], left[i - 1])

        ans = 0
        for i in range(n):
            ans += min(left[i], right[i]) - height[i]
        return ans
</pre>
</div>

<p>
但是 <a href="https://leetcode.com/problems/trapping-rain-water/discuss/17527/My-Accepted-Java-Solution">thread</a> 里面有个更好的办法，space是O(1). 想法和我的差不多，但是首先找到max_index,
然后分开两个部分计算。这样左边只需要维护left, 右边只需要维护right, 那么空间复杂度就可以降到O(1).
</p>

<div class="org-src-container">
<pre class="src src-Java">public int trap(int[] height) {
    if (height.length &lt;= 2) return 0;
    int max = Integer.MIN_VALUE;
    int maxIndex = -1;
    for (int i = 0; i &lt; height.length; i++) {
        if (height[i] &gt; max) {
            max = height[i];
            maxIndex = i;
        }
    }

    int leftMax = height[0];
    int water = 0;
    for (int i = 1; i &lt; maxIndex; i++) {
        if (height[i] &gt; leftMax) {
            leftMax = height[i];
        } else {
            water += leftMax - height[i];
        }
    }

    int rightMax = height[height.length - 1];
    for (int i = height.length - 2; i &gt; maxIndex; i--) {
        if (height[i] &gt; rightMax) {
            rightMax = height[i];
        } else {
            water += rightMax - height[i];
        }
    }

    return water;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecfaa49" class="outline-3">
<h3 id="orgecfaa49"><span class="section-number-3">1.2</span> <a href="https://leetcode.com/problems/sort-colors/description/">Sort Colors @ leetcode</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
这个题目就是三色旗排序问题，维护三个指针(left, right, now)分别表示存放0,2的位置以及当前位置。
终止条件是`now &gt; right`
</p>

<div class="org-src-container">
<pre class="src src-Python">#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution(object):
    def sortColors(self, nums):
        """
        :type nums: List[int]
        :rtype: void Do not return anything, modify nums in-place instead.
        """

        n = len(nums)
        x, y = 0, n - 1
        i = 0
        while i &lt;= y:
            if nums[i] == 0:
                nums[x], nums[i] = nums[i], nums[x]
                assert nums[x] in (0, 1)
                x += 1
                i += 1 # 这里可以前移是因为掉过来的值只能是1，如果是2的话已经放在最右端了。
            elif nums[i] == 2:
                nums[y], nums[i] = nums[i], nums[y]
                y -= 1
            else:
                i += 1

</pre>
</div>
</div>
</div>

<div id="outline-container-org817d50a" class="outline-3">
<h3 id="org817d50a"><span class="section-number-3">1.3</span> <a href="https://leetcode.com/problems/3sum/description/">3Sum @ leetcode</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
这题目的时间复杂度是O(n^2)没有太多问题，我觉得值得学习的地方是进行去重。当然可以首先获得所有可能的结果，然后统一进行去重，
但是那样效率比较低有额外的数据结构。更好的办法是在搜索的时候就进行去重，代码如下：（另外Python3是完全压线过去的，用C++重写不难）
</p>

<div class="org-src-container">
<pre class="src src-Python">class Solution(object):
    def threeSum(self, nums):
        """
        :type nums: List[int]
        :rtype: List[List[int]]
        """
        nums.sort()
        n = len(nums)
        ans = []

        for i in range(n):
            if i &gt; 0 and nums[i] == nums[i - 1]: continue

            target = 0 - nums[i]
            j, k = i + 1, n - 1
            while j &lt; k:
                value = nums[j] + nums[k]
                if value == target:
                    a, b, c = nums[i], nums[j], nums[k]
                    value = (a, b, c)
                    ans.append(value)
                    j += 1
                    k -= 1
                    while j &lt; k and nums[j] == nums[j - 1]:
                        j += 1
                    while j &lt; k and nums[k] == nums[k + 1]:
                        k -= 1
                elif value &gt; target:
                    k -= 1
                    while j &lt; k and nums[k] == nums[k + 1]:
                        k -= 1
                else:
                    j += 1
                    while j &lt; k and nums[j] == nums[j - 1]:
                        j += 1
        return ans
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1642ac" class="outline-3">
<h3 id="orga1642ac"><span class="section-number-3">1.4</span> <a href="https://leetcode.com/problems/first-missing-positive/description/">First Missing Positive @ leetcode</a></h3>
<div class="outline-text-3" id="text-1-4">
<p>
pass1: 遍历所有的元素，将这些元素尽可能地放置到应该的位置。
</p>

<p>
pass2: 遍历归置好的数组，输出结果。
</p>

<p>
这个解法很有通用性。leetcode上还有一些题目也可以按照这个思路来解决 <a href="https://leetcode.com/problems/find-all-numbers-disappeared-in-an-array/description/">448. Find All Numbers Disappeared in an Array</a> 和 <a href="https://leetcode.com/problems/find-all-duplicates-in-an-array/description/">442. Find All Duplicates in an Array</a>
</p>

<div class="org-src-container">
<pre class="src src-Python">class Solution(object):
    def firstMissingPositive(self, nums):
        """
        :type nums: List[int]
        :rtype: int
        """

        n = len(nums)
        for i in range(n):
            x = nums[i]
            while 0 &lt; x &lt;= n and nums[x - 1] != x:
                nums[i], nums[x - 1] = nums[x - 1], nums[i]
                x = nums[i]

        print(nums)
        for i in range(n):
            x = nums[i]
            if (i + 1) != x:
                return i + 1
        return n + 1
</pre>
</div>
</div>
</div>
