src/competitive-programming-problems.org
** [[https://leetcode.com/problems/find-all-numbers-disappeared-in-an-array/description/][Find All Numbers Disappeared in an Array @ leetcode]]

这个题目可以按照 "First Missing Positive" 的解法来做

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution:
    def findDisappearedNumbers(self, nums):
        """
        :type nums: List[int]
        :rtype: List[int]
        """

        n = len(nums)
        for i in range(n):
            while nums[i] != (i + 1):
                x = nums[i]
                y = nums[x - 1]
                if y == x:
                    break
                nums[i], nums[x - 1] = nums[x - 1], nums[i]
        ans = []
        for i in range(n):
            if nums[i] != (i + 1):
                ans.append(i + 1)
        return ans
#+END_SRC

我在 [[https://leetcode.com/problems/find-all-numbers-disappeared-in-an-array/discuss/92958/c++-solution-O(1)-space][thread]] 里面也看到了另外一种解法很有意思。如果x出现的话，那么将nums[x-1]做符号翻转（当然也可以做其他信息存储），
在pass2的时候，如果nums[i]变为了负值说明(i+1)出现了一次，否则说明(i+1)就没有出现过。

#+BEGIN_SRC C++
class Solution {
public:
    vector<int> findDisappearedNumbers(vector<int>& nums) {
        int len = nums.size();
        for(int i=0; i<len; i++) {
            int m = abs(nums[i])-1; // index start from 0
            nums[m] = nums[m]>0 ? -nums[m] : nums[m];
        }
        vector<int> res;
        for(int i = 0; i<len; i++) {
            if(nums[i] > 0) res.push_back(i+1);
        }
        return res;
    }
};
#+END_SRC

** [[https://leetcode.com/problems/shortest-unsorted-continuous-subarray/description/][Shortest Unsorted Continuous Subarray @ leetcode]]

我的想法是，如果某个位置i, max(nums[..i]) <= nums[i] <= min(nums[i+1..]) 满足这个条件的话，那么就不是一个合法
的置换点，不满足这个条件的话才需要进行调换。然后只需要找到最小和最大的两个置换点即可。为了O(1)计算max/min的话，那么
需要O(n)的辅助空间进行记录。

#+BEGIN_SRC Python
class Solution:
    def findUnsortedSubarray(self, nums):
        """
        :type nums: List[int]
        :rtype: int
        """

        n = len(nums)
        if n == 0: return 0

        right = [0] * n
        right[-1] = nums[-1]
        for i in range(n - 2, -1, -1):
            right[i] = min(right[i + 1], nums[i])
        left = [0] * n
        left[0] = nums[0]
        for i in range(1, n):
            left[i] = max(left[i - 1], nums[i])

        x, y = None, None
        for i in range(n):
            if not (left[i] <= nums[i] <= right[i]):
                x = i
                break
        for i in reversed(range(n)):
            if not (left[i] <= nums[i] <= right[i]):
                y = i
                break
        if x is None:
            return 0
        return y - x + 1
#+END_SRC

不过我在 [[https://leetcode.com/problems/shortest-unsorted-continuous-subarray/discuss/103057/Java-O(n)-Time-O(1)-Space][thread]] 里面看到了另外一个更好的解法，不需要辅助空间，只需要沿着两个方向分别找到最小和最大值即可。

#+BEGIN_SRC Python
class Solution:
    def findUnsortedSubarray(self, nums):
        """
        :type nums: List[int]
        :rtype: int
        """

        n = len(nums)
        if n == 0: return 0

        left_max = nums[0]
        end = None
        for i in range(n):
            left_max = max(left_max, nums[i])
            if nums[i] < left_max:
                end = i

        right_min = nums[-1]
        begin = None
        for i in reversed(range(n)):
            right_min = min(right_min, nums[i])
            if nums[i] > right_min:
                begin = i

        if end is None:
            return 0
        return end - begin + 1
#+END_SRC

** [[https://leetcode.com/problems/sum-of-subarray-minimums/description/][Sum of Subarray Minimums @ leetcode]]

This solution is very similar to [[https://leetcode.com/problems/largest-rectangle-in-histogram/description/][84. Largest Rectangle in Histogram]]

we maintain a stack of tuple (x, i, j). x = A[i], and i is the index. j is the least index which A[j] < A[i].

when we iterates kth value, if this value is smaller than stack top value such as (x, i, j), it means

x is the smallest value of range A[j..k], on the left there are (i-j+1) values, on the right there are (k-j) values

#+BEGIN_SRC Python
class Solution:
    def sumSubarrayMins(self, A):
        """
        :type A: List[int]
        :rtype: int
        """

        st = []
        # (v, i, j), v = A[i]
        # j means least index which A[j] < A[i]

        MOD = 10 ** 9 + 7
        n = len(A)
        ans = 0
        for i in range(n):
            j = i
            while st and A[i] < st[-1][0]:
                x = st[-1]
                ans += x[0] * (i - x[1]) * (x[1] - x[2] + 1)
                ans = ans % MOD
                j = x[2]
                st.pop()
            st.append((A[i], i, j))

        while st:
            x = st[-1]
            ans += x[0] * (n - x[1]) * (x[1] - x[2] + 1)
            ans = ans % MOD
            st.pop()
        return ans

#+END_SRC

