src/competitive-programming-problems.org
** [[https://leetcode.com/problems/image-overlap/description/][Image Overlap @ leetcode]]

这个题目应该只能通过穷举来完成，关键是如何有效地筛选掉没有overlap的偏移。我的做法是将行使用bits表示，
然后通过位运算判断是否有overlap, 对于没有overlap可以快速掉过，否则就需要统计里面1的个数。

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution:
    def largestOverlap(self, A, B):
        """
        :type A: List[List[int]]
        :type B: List[List[int]]
        :rtype: int
        """

        n = len(A)

        Ax = [0] * n
        Bx = [0] * n
        for i in range(n):
            val1 = 0
            val2 = 0
            for j in range(n):
                val1 = (val1 << 1) + A[i][j]
                val2 = (val2 << 1) + B[i][j]
            Ax[i] = val1
            Bx[i] = val2

        # print(Ax, Bx)

        def check(r, c, Ax, Bx):
            res = 0
            for i in range(r, n):
                mask = (1 << (n - c)) - 1
                val = (Ax[i] & mask) & (Bx[i - r] >> c)
                while val:
                    if val & 0x1:
                        res += 1
                    val = val // 2
            return res

        ans = 0
        for i in range(n):
            for j in range(n):
                res = check(i, j, Ax, Bx)
                ans = max(ans, res)
                res = check(i, j, Bx, Ax)
                ans = max(ans, res)

        return ans
#+END_SRC

在 [[https://leetcode.com/problems/image-overlap/discuss/130623/C++JavaPython-Straight-Forward][thread]] 里面给了一个解法也非常漂亮，将每个(x,y)映射成为唯一的整数，然后统计所有整数可能的差并且累加。
不同的差表示不同的shift方案，对应的值就是重叠区域里面的1的个数。

#+BEGIN_SRC Python
 def largestOverlap(self, A, B):
        N = len(A)
        LA = [i / N * 100 + i % N for i in xrange(N * N) if A[i / N][i % N]]
        LB = [i / N * 100 + i % N for i in xrange(N * N) if B[i / N][i % N]]
        c = collections.Counter(i - j for i in LA for j in LB)
        return max(c.values() or [0])
#+END_SRC

至于为什么这面选择100，是因为需要确保(x,y)映射成为唯一整数。可以想象，如果两个列超相反方向移动N的话，
（这个是最极端的情况，并且列上是没有重合的），所以行的base需要确保是>=2N. 作者在thread里面也给出了解释。

#+BEGIN_EXAMPLE
Update 2018-05-15 about i / N * 100 + i % N
I find many people discuss it, so I update this explanantion.

1.why 100?
100 is big enough and very clear.
For example, If I slide 13 rows and 19 cols, it will be 1319.

why not 30?
30 is not big enough.
For example: 409 = 13 * 30 + 19 = 14 * 30 - 11.
409 can be taken as sliding "14 rows and -11 cols" or "13 rows and 19 cols" at the same time.

How big is enough?
Bigger than 2N-1. Bigger than 2N-1. Bigger than 2N-1.

Can we replace i / N * 100 + i % N by i?
No, it's wrong for simple test case [[0,1],[1,1]], [[1,1],[1,0]]
#+END_EXAMPLE

** [[https://leetcode.com/problems/number-of-matching-subsequences/description/][792. Number of Matching Subsequences @ leetcode]]

首先需要确定的是，这个匹配是一个贪婪匹配，尽可能地向前匹配是安全的。
然后一旦字符w[j]在S[i]匹配之后，我们最关心的其实是，w[j+1]会在哪个位置k匹配，其中k>i.
而这个信息其实是可以被缓存的，占用空间是O(n * 26).

#+BEGIN_SRC Python

class Solution:
    def numMatchingSubseq(self, S, words):
        """
        :type S: str
        :type words: List[str]
        :rtype: int
        """

        cache = {}
        n = len(S)

        def find_next(i, ch):
            key = '{}.{}'.format(i, ch)
            if key in cache:
                return cache[key]

            ans = n
            for j in range(i, n):
                if S[j] == ch:
                    ans = j
                    break
            cache[key] = ans
            return ans

        ans = 0
        for w in words:
            i = 0
            matched = True
            for ch in w:
                j = find_next(i, ch)
                if j == n:
                    matched = False
                    break
                i = j + 1
            if matched:
                ans += 1
        return ans
#+END_SRC

** [[https://leetcode.com/problems/transform-to-chessboard/description/][782. Transform to Chessboard @ leetcode]]

可以互换的前提是，行列里面只能有两种值a, b:
1. a & b = 0
2. a | b = (1 << n) - 1
3. a, b的数量各占一半或者是k+1,k

然后在计算swap次数的时候，假设0110要变成0101,
那么只需要计算有差异的位置个数(然后//2即可)

#+BEGIN_SRC Python
class Solution:
    def movesToChessboard(self, board):
        """
        :type board: List[List[int]]
        :rtype: int
        """

        n = len(board)

        # for i in range(n):
        #     print(board[i])

        def try_swap(xs):
            cnt = 0
            temp = []
            for i in range(n):
                if xs[i] == xs[0]:
                    cnt += 1
                    temp.append(0)
                elif ((xs[0] & xs[i]) == 0) and ((xs[0] | xs[i]) == (1 << n) - 1):
                    temp.append(1)
                else:
                    return -1
            if abs(n - cnt - cnt) > 1:
                return -1

            cnt0, cnt1 = 0, 0
            exp = 0
            for i in range(n):
                if temp[i] != exp:
                    cnt0 += 1
                if temp[i] != (1 - exp):
                    cnt1 += 1
                exp = 1 - exp

            res = 1 << 10
            if cnt0 % 2 == 0:
                res = min(res, cnt0 // 2)
            if cnt1 % 2 == 0:
                res = min(res, cnt1 // 2)
            return res

        ans = 0
        # handle row
        xs = []
        for i in range(n):
            value = 0
            for j in range(n):
                value = (value << 1) | board[i][j]
            xs.append(value)
        res = try_swap(xs)
        if res == -1:
            return -1
        ans += res

        # handle col
        xs = []
        for j in range(n):
            value = 0
            for i in range(n):
                value = (value << 1) | board[i][j]
            xs.append(value)
        res = try_swap(xs)
        if res == -1:
            return -1
        ans += res
        return ans
#+END_SRC

** [[https://leetcode.com/problems/partition-array-into-disjoint-intervals/description/][915. Partition Array into Disjoint Intervals @ leetcode]]

这题目和 [[https://leetcode.com/problems/max-chunks-to-make-sorted-ii/description/][768. Max Chunks To Make Sorted II]] 非常类似，不过它只需要取第一个interval就行。
所以这题虽然也可以使用O(n)空间和O(n)时间来解决。

使用O(n)空间的算法如下。right[i]表示从A[i]向右的最小值是多少。
#+BEGIN_SRC Python
class Solution:
    def partitionDisjoint(self, A):
        """
        :type A: List[int]
        :rtype: int
        """

        n = len(A)
        right = [0] * n
        right[-1] = A[-1]
        for i in range(n - 2, -1, -1):
            right[i] = min(right[i + 1], A[i])

        value = A[0]
        for i in range(n - 1):
            value = max(value, A[i])
            if value <= right[i + 1]:
                return i + 1
        raise RuntimeError()
#+END_SRC

不过我们可以进一步优化到O(1)空间. i是扫描下表，j是观察后续元素是否都比max(A[..i])要大。
如果j不符合条件的话，那么j也不能回退。所以时间复杂度是O(n).

#+BEGIN_SRC Python
class Solution:
    def partitionDisjoint(self, A):
        """
        :type A: List[int]
        :rtype: int
        """

        n = len(A)
        value = A[0]
        i, j = 0, 0
        while j < n:
            if value <= A[j]:
                j += 1
            else:
                i += 1
                value = max(value, A[i])
                j = max(i + 1, j)
        return i + 1
#+END_SRC

