src/competitive-programming-problems.org
** [[https://leetcode.com/problems/my-calendar-ii/description/][731. My Calendar II]]

这题目是 [[https://leetcode.com/problems/my-calendar-i/description/][729. My Calendar I]] 的扩展。II的解法可以用在I上面，而I最好的解法还是手写平衡树来判断是否存在重叠。
这个时间复杂度是O(lgn). 但是手写平衡树这件事情，我个人觉得在leetcode上没有什么意义。我们可以查找[start, end)
可能重叠的附近两个区间O(lgn), 判断是否重合。如果不重合的话，那么还是需要使用O(n)操作进行插入。

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt
import bisect


class MyCalendar:

    def __init__(self):
        self.xs = []
        self.ys = []

    def book(self, start, end):
        """
        :type start: int
        :type end: int
        :rtype: bool
        """
        i = bisect.bisect_left(self.xs, start)
        # compare to self.ys[i-1] and self.xs[i]
        if (i - 1) >= 0:
            if start < self.ys[i - 1]:
                return False
        if i < len(self.xs):
            if end > self.xs[i]:
                return False
        self.xs.insert(i, start)
        self.ys.insert(i, end)
        return True

#+END_SRC

而II这题目不管是手写平衡树，还是使用这种讨巧的办法，最坏情况下面时间复杂度都是O(n). 手写平衡树需要进行区间分隔，
代码比较长而且很容易出错，实现可以看 [[file:codes/contest/lintcode/my-calendar-ii.py][code on github]]. 一种更好的实现是，维护一个计数器overlap，每当进入某个区间的时候
overlap+1, 从某个区间出来的时候overlap-1. 如果在某个时候overlap >=3 的话，那么说明有3个区间交叠。

一种实现是维护数组A, 元素是(x, d). 其中x是位置，d表示进还是出，数组A是按照x排序的，如果x相当出优先。
不过这种实现每次添加一个区间需要对A重新排序。为了避免每次都进行排序，我们可以维护一个map<int, int> counter.

#+BEGIN_SRC C++
/* coding:utf-8
 * Copyright (C) dirlt
 */

#include <algorithm>
#include <map>
#include <queue>
#include <set>
#include <string>
#include <vector>
using namespace std;

class MyCalendar {
   public:
    map<int, int> counter;
    MyCalendar() {}

    bool book(int start, int end) {
        counter[start] += 1;
        counter[end] -= 1;
        int overlap = 0;
        auto ans = true;
        for (auto it = counter.begin(); it != counter.end(); ++it) {
            if (it->first > end) {
                break;
            }
            overlap += it->second;
            if (overlap >= 2) {
                ans = false;
                break;
            }
        }
        if (!ans) {
            counter[start] -= 1;
            counter[end] += 1;
        }
        return ans;
    }
};

#+END_SRC

* Math
** [[Https://leetcode.com/problems/poor-pigs/description/][Poor Pigs @ leetcode]]

这个 [[https://leetcode.com/problems/poor-pigs/discuss/94266/another-explanation-and-solution][thread]] 给出的解释非常清晰

#+BEGIN_EXAMPLE

With 2 pigs, poison killing in 15 minutes, and having 60 minutes, we can find the poison in up to 25 buckets in the following way.
Arrange the buckets in a 5×5 square:

 1  2  3  4  5
 6  7  8  9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25
Now use one pig to find the row (make it drink from buckets 1, 2, 3, 4, 5, wait 15 minutes,
make it drink from buckets 6, 7, 8, 9, 10, wait 15 minutes, etc).
Use the second pig to find the column (make it drink 1, 6, 11, 16, 21, then 2, 7, 12, 17, 22, etc).

Having 60 minutes and tests taking 15 minutes means we can run four tests.
If the row pig dies in the third test, the poison is in the third row.
If the column pig doesn't die at all, the poison is in the fifth column
(this is why we can cover five rows/columns even though we can only run four tests).

With 3 pigs, we can similarly use a 5×5×5 cube instead of a 5×5 square and again use one pig to determine the coordinate of one dimension
(one pig drinks layers from top to bottom, one drinks layers from left to right, one drinks layers from front to back).
So 3 pigs can solve up to 125 buckets.

#+END_EXAMPLE

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution(object):
    def poorPigs(self, buckets, minutesToDie, minutesToTest):
        """
        :type buckets: int
        :type minutesToDie: int
        :type minutesToTest: int
        :rtype: int
        """
        pigs = 0
        rounds = minutesToTest / minutesToDie
        while True:
            if (rounds + 1) ** pigs >= buckets:
                break
            pigs += 1
        return pigs

if __name__ == '__main__':
    s = Solution()
    print(s.poorPigs(1000, 15, 60))

#+END_SRC

