html/competitive-programming-problems.html

<div id="outline-container-org951b960" class="outline-3">
<h3 id="org951b960"><span class="section-number-3">1.12</span> <a href="https://leetcode.com/problems/my-calendar-ii/description/">731. My Calendar II</a></h3>
<div class="outline-text-3" id="text-1-12">
<p>
这题目是 <a href="https://leetcode.com/problems/my-calendar-i/description/">729. My Calendar I</a> 的扩展。II的解法可以用在I上面，而I最好的解法还是手写平衡树来判断是否存在重叠。
这个时间复杂度是O(lgn). 但是手写平衡树这件事情，我个人觉得在leetcode上没有什么意义。我们可以查找[start, end)
可能重叠的附近两个区间O(lgn), 判断是否重合。如果不重合的话，那么还是需要使用O(n)操作进行插入。
</p>

<div class="org-src-container">
<pre class="src src-Python">#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt
import bisect


class MyCalendar:

    def __init__(self):
        self.xs = []
        self.ys = []

    def book(self, start, end):
        """
        :type start: int
        :type end: int
        :rtype: bool
        """
        i = bisect.bisect_left(self.xs, start)
        # compare to self.ys[i-1] and self.xs[i]
        if (i - 1) &gt;= 0:
            if start &lt; self.ys[i - 1]:
                return False
        if i &lt; len(self.xs):
            if end &gt; self.xs[i]:
                return False
        self.xs.insert(i, start)
        self.ys.insert(i, end)
        return True

</pre>
</div>

<p>
而II这题目不管是手写平衡树，还是使用这种讨巧的办法，最坏情况下面时间复杂度都是O(n). 手写平衡树需要进行区间分隔，
代码比较长而且很容易出错，实现可以看 <a href="https://github.com/maypeppa/maypeppa.github.io/tree/master/codes/contest/lintcode/my-calendar-ii.py">code on github</a>. 一种更好的实现是，维护一个计数器overlap，每当进入某个区间的时候
overlap+1, 从某个区间出来的时候overlap-1. 如果在某个时候overlap &gt;=3 的话，那么说明有3个区间交叠。
</p>

<p>
一种实现是维护数组A, 元素是(x, d). 其中x是位置，d表示进还是出，数组A是按照x排序的，如果x相当出优先。
不过这种实现每次添加一个区间需要对A重新排序。为了避免每次都进行排序，我们可以维护一个map&lt;int, int&gt; counter.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-comment-delimiter">/* </span><span class="org-comment">coding:utf-8</span>
<span class="org-comment"> * Copyright (C) dirlt</span>
<span class="org-comment"> */</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;algorithm&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;map&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;queue&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;set&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;vector&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-keyword">class</span> <span class="org-type">MyCalendar</span> {
   <span class="org-keyword">public</span>:
    <span class="org-type">map</span>&lt;<span class="org-type">int</span>, <span class="org-type">int</span>&gt; <span class="org-variable-name">counter</span>;
    <span class="org-function-name">MyCalendar</span>() {}

    <span class="org-type">bool</span> <span class="org-function-name">book</span>(<span class="org-type">int</span> <span class="org-variable-name">start</span>, <span class="org-type">int</span> <span class="org-variable-name">end</span>) {
        counter[start] += 1;
        counter[end] -= 1;
        <span class="org-type">int</span> <span class="org-variable-name">overlap</span> = 0;
        <span class="org-keyword">auto</span> <span class="org-variable-name">ans</span> = <span class="org-constant">true</span>;
        <span class="org-keyword">for</span> (<span class="org-keyword">auto</span> <span class="org-variable-name">it</span> = counter.begin(); it != counter.end(); ++it) {
            <span class="org-keyword">if</span> (it-&gt;first &gt; end) {
                <span class="org-keyword">break</span>;
            }
            overlap += it-&gt;second;
            <span class="org-keyword">if</span> (overlap &gt;= 2) {
                ans = <span class="org-constant">false</span>;
                <span class="org-keyword">break</span>;
            }
        }
        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>ans) {
            counter[start] -= 1;
            counter[end] += 1;
        }
        <span class="org-keyword">return</span> ans;
    }
};

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8217648" class="outline-2">
<h2 id="org8217648"><span class="section-number-2">2</span> Math</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga3ea965" class="outline-3">
<h3 id="orga3ea965"><span class="section-number-3">2.1</span> <a href="//leetcode.com/problems/poor-pigs/description/">Poor Pigs @ leetcode</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
这个 <a href="https://leetcode.com/problems/poor-pigs/discuss/94266/another-explanation-and-solution">thread</a> 给出的解释非常清晰
</p>

<pre class="example">

With 2 pigs, poison killing in 15 minutes, and having 60 minutes, we can find the poison in up to 25 buckets in the following way.
Arrange the buckets in a 5×5 square:

 1  2  3  4  5
 6  7  8  9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25
Now use one pig to find the row (make it drink from buckets 1, 2, 3, 4, 5, wait 15 minutes,
make it drink from buckets 6, 7, 8, 9, 10, wait 15 minutes, etc).
Use the second pig to find the column (make it drink 1, 6, 11, 16, 21, then 2, 7, 12, 17, 22, etc).

Having 60 minutes and tests taking 15 minutes means we can run four tests.
If the row pig dies in the third test, the poison is in the third row.
If the column pig doesn't die at all, the poison is in the fifth column
(this is why we can cover five rows/columns even though we can only run four tests).

With 3 pigs, we can similarly use a 5×5×5 cube instead of a 5×5 square and again use one pig to determine the coordinate of one dimension
(one pig drinks layers from top to bottom, one drinks layers from left to right, one drinks layers from front to back).
So 3 pigs can solve up to 125 buckets.

</pre>

<div class="org-src-container">
<pre class="src src-Python">#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution(object):
    def poorPigs(self, buckets, minutesToDie, minutesToTest):
        """
        :type buckets: int
        :type minutesToDie: int
        :type minutesToTest: int
        :rtype: int
        """
        pigs = 0
        rounds = minutesToTest / minutesToDie
        while True:
            if (rounds + 1) ** pigs &gt;= buckets:
                break
            pigs += 1
        return pigs

if __name__ == '__main__':
    s = Solution()
    print(s.poorPigs(1000, 15, 60))

</pre>
</div>
</div>
</div>
