src/competitive-programming-problems.org
** [[https://leetcode.com/problems/reconstruct-original-digits-from-english/description/][Reconstruct Original Digits from English @ leetcode]]

这题目如果使用递归的话会出现TLE. 讨论区里面 tornmy 给出的方法很对，就是其实每个数字英语表示都可以通过一个字母来完全确定。

#+BEGIN_EXAMPLE
In general situation, it should be transformed into a problem to calculate A from AX=B, matrix X is formed as follows,
         //                                             /// efghinorstuvwxz ///
        // 0 z e r o        e         o  r            z    100000110000001
        // 1 o n e          e        no                    100001100000000
        // 2 t w o                    o      t    w         000000100100100
        // 3 t h r e e      e    h       r   t              200100010100000
        // 4 f o u r          f       o  r     u             010000110010000
        // 5 f i v e        e f    i             v            110010000001000
        // 6 s i x                 i       s        x          000010001000010
        // 7 s e v e n      e        n     s     v        200001001001000
        // 8 e i g h t      e  g h i         t              101110000100000
        // 9 n i n e        e      i n                       100012000000000
#+END_EXAMPLE

从上面分析可以看到，"zero"的z是唯一的，"six"的x是唯一的，依次类推。

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt


class Solution:
    def originalDigits(self, s):
        """
        :type s: str
        :rtype: str
        """

        def ch2idx(c):
            return ord(c) - ord('a')

        counter = [0] * 26
        for c in s:
            idx = ch2idx(c)
            counter[idx] += 1

        preps = []
        for word in ('zero', 'one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine'):
            vec = []
            for c in word:
                vec.append(ch2idx(c))
            preps.append(vec)

        def remove_chars(c, digit):
            idx = ch2idx(c)
            prep = preps[digit]
            cnt = counter[idx]
            for idx in prep:
                counter[idx] -= cnt
            return str(digit) * cnt

        res = ''
        res += remove_chars('z', 0)
        res += remove_chars('x', 6)
        res += remove_chars('w', 2)
        res += remove_chars('u', 4)
        res += remove_chars('g', 8)
        res += remove_chars('o', 1)
        res += remove_chars('h', 3)
        res += remove_chars('f', 5)
        res += remove_chars('v', 7)
        res += remove_chars('i', 9)
        res = list(res)
        res.sort()
        res = ''.join(res)
        return res
#+END_SRC

** [[https://leetcode.com/problems/sum-of-subsequence-widths/description/][Sum of Subsequence Widths @ leetcode]]

这里有个很奇妙的公式推导，首先对A进行排序。假设S[i]是A[0..i]所有序列的width之和。那么有ans = sum(S[0..n-1]).

然后有这个几个规律：
1. A[i+1] 是 A[0..i+1]的最大值，最小值是A[0]
2. A[i..j]所有序列的width之和是 (A[j]-A[i]) * 2 ^ (j-i-1)
3. S[j]包括A[0..j], A[1..j] ... A[j-1..j]
4. S[j+1]包括A[0..j+1], A[1..j+1] ... A[j-1..j+1], A[j..j+1]
5. S[j+1] - 2*S[j] = (A[j+1] - A[j]) * (2^j + 2^(j-1) + ...1) = (A[j+1]-A[j]) * (2^(j+1) -1 )

所以 S[i+1] = (2^(i+1) - 1) * (A[i+1]-A[i]) + 2*S[i].

这个问题朝着O(n)的解法去基本上都能想出来。

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution:
    def sumSubseqWidths(self, A):
        """
        :type A: List[int]
        :rtype: int
        """

        n = len(A)
        A.sort()
        ans = 0
        last = 0
        p2 = 1
        MOD = 10 ** 9 + 7
        for i in range(n - 1):
            p2 = (p2 * 2) % MOD
            now = (p2 - 1) * (A[i + 1] - A[i]) + 2 * last
            now = now % MOD
            ans = (ans + now) % MOD
            last = now
        return ans

#+END_SRC

** [[https://leetcode.com/problems/perfect-squares/description/][279. Perfect Squares @ leetcode]]

这题可以使用动态规划来解决，空间复杂度是O(n), 时间复杂度是O(n^(3/2)).

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt


class Solution:
    def __init__(self):
        self.dp = [0]

    def numSquares(self, n):
        """
        :type n: int
        :rtype: int
        """

        dp = self.dp
        while len(dp) <= n:
            x = len(dp)
            ans = 1 << 30
            for p in range(1, x + 1):
                p2 = p ** 2
                if p2 > x:
                    break
                ans = min(ans, dp[x - p2] + 1)
            dp.append(ans)
        return dp[n]

#+END_SRC

但是在 [[https://leetcode.com/problems/perfect-squares/discuss/180403/C++-O(sqrt(n))-Solution-Using-Legendre's-Three-Square-Theorem-Beats-100][thread]] 里面给了更加精妙的 [[https://en.wikipedia.org/wiki/Legendre's_three-square_theorem][Legendre's three-square theorem]] 和 [[https://en.wikipedia.org/wiki/Lagrange%27s_four-square_theorem][Lagrange's four-square theorem]]
空间复杂度是O(1), 时间复杂度是O(sqrt(n)).“所有整数都可以表示成为四个平方数之和”，“所有整数都可以表示成为
三个平方数之和，除非n满足4^a * (8b+7)这样的形式”。数论真的是太神奇了！

#+BEGIN_SRC C++
class Solution {
    bool isSquare(int n) {
        int sqroot = floor(sqrt(n));

        return sqroot * sqroot == n;
    }
public:
    int numSquares(int n) {
        if(isSquare(n))
            return 1;

        for(int i = 1; i*i < n; i++) {
            if(isSquare(n - i*i))
                return 2;
        }

        int p4 = 1;
        while(n % (4 * p4) == 0)
            p4 *= 4;

        if((n / p4)%8 == 7)
            return 4;

        return 3;
    }
};
#+END_SRC

* DP
** [[https://www.rqnoj.cn/problem/314][NOIP2000方格取数]]

https://blog.csdn.net/rowanhaoa/article/details/15816067

这种动态规划解法还被称为多线程dp. 我理解这里的多线程是指同时考虑两条路径的状态。

dp[step][x][y] 表示移动了step步，path1停留在(i, step-i)上，path2停留在(j, step-j)上的路径和。

#+BEGIN_SRC Python
def solve(graph, n):
    inf = 1 << 30
    neg_inf = -inf

    # for i in range(n):
    #     print(graph[i])

    dp = [[[neg_inf for _ in range(n)] for _ in range(n)] for _ in range(2)]
    now = 0
    dp[now][0][0] = graph[0][0]

    def get_dp(k, i, j):
        if i < 0 or j < 0:
            return neg_inf
        return dp[k][i][j]

    for step in range(1, 2 * n - 1):
        for i in range(n):
            for j in range(n):
                # if 0 <= (step - i) < n and 0 <= (step - j) < n:
                if i > step or j > step: continue
                if (i + n) <= step or (j + n) <= step: continue
                res = max(get_dp(now, i - 1, j), get_dp(now, i, j - 1),
                          get_dp(now, i - 1, j - 1), get_dp(now, i, j))
                res += graph[i][step - i]
                if i != j:
                    res += graph[j][step - j]
                dp[1 - now][i][j] = res
        now = 1 - now

    return dp[now][n - 1][n - 1]
#+END_SRC
