html/competitive-programming-problems.html

<div id="outline-container-org1363317" class="outline-3">
<h3 id="org1363317"><span class="section-number-3">2.2</span> <a href="https://leetcode.com/problems/reconstruct-original-digits-from-english/description/">Reconstruct Original Digits from English @ leetcode</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
这题目如果使用递归的话会出现TLE. 讨论区里面 tornmy 给出的方法很对，就是其实每个数字英语表示都可以通过一个字母来完全确定。
</p>

<pre class="example">
In general situation, it should be transformed into a problem to calculate A from AX=B, matrix X is formed as follows,
         //                                             /// efghinorstuvwxz ///
        // 0 z e r o        e         o  r            z    100000110000001
        // 1 o n e          e        no                    100001100000000
        // 2 t w o                    o      t    w         000000100100100
        // 3 t h r e e      e    h       r   t              200100010100000
        // 4 f o u r          f       o  r     u             010000110010000
        // 5 f i v e        e f    i             v            110010000001000
        // 6 s i x                 i       s        x          000010001000010
        // 7 s e v e n      e        n     s     v        200001001001000
        // 8 e i g h t      e  g h i         t              101110000100000
        // 9 n i n e        e      i n                       100012000000000
</pre>

<p>
从上面分析可以看到，"zero"的z是唯一的，"six"的x是唯一的，依次类推。
</p>

<div class="org-src-container">
<pre class="src src-Python">#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt


class Solution:
    def originalDigits(self, s):
        """
        :type s: str
        :rtype: str
        """

        def ch2idx(c):
            return ord(c) - ord('a')

        counter = [0] * 26
        for c in s:
            idx = ch2idx(c)
            counter[idx] += 1

        preps = []
        for word in ('zero', 'one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine'):
            vec = []
            for c in word:
                vec.append(ch2idx(c))
            preps.append(vec)

        def remove_chars(c, digit):
            idx = ch2idx(c)
            prep = preps[digit]
            cnt = counter[idx]
            for idx in prep:
                counter[idx] -= cnt
            return str(digit) * cnt

        res = ''
        res += remove_chars('z', 0)
        res += remove_chars('x', 6)
        res += remove_chars('w', 2)
        res += remove_chars('u', 4)
        res += remove_chars('g', 8)
        res += remove_chars('o', 1)
        res += remove_chars('h', 3)
        res += remove_chars('f', 5)
        res += remove_chars('v', 7)
        res += remove_chars('i', 9)
        res = list(res)
        res.sort()
        res = ''.join(res)
        return res
</pre>
</div>
</div>
</div>

<div id="outline-container-orge226306" class="outline-3">
<h3 id="orge226306"><span class="section-number-3">2.3</span> <a href="https://leetcode.com/problems/sum-of-subsequence-widths/description/">Sum of Subsequence Widths @ leetcode</a></h3>
<div class="outline-text-3" id="text-2-3">
<p>
这里有个很奇妙的公式推导，首先对A进行排序。假设S[i]是A[0..i]所有序列的width之和。那么有ans = sum(S[0..n-1]).
</p>

<p>
然后有这个几个规律：
</p>
<ol class="org-ol">
<li>A[i+1] 是 A[0..i+1]的最大值，最小值是A[0]</li>
<li>A[i..j]所有序列的width之和是 (A[j]-A[i]) * 2 ^ (j-i-1)</li>
<li>S[j]包括A[0..j], A[1..j] &#x2026; A[j-1..j]</li>
<li>S[j+1]包括A[0..j+1], A[1..j+1] &#x2026; A[j-1..j+1], A[j..j+1]</li>
<li>S[j+1] - 2*S[j] = (A[j+1] - A[j]) * (2^j + 2^(j-1) + &#x2026;1) = (A[j+1]-A[j]) * (2^(j+1) -1 )</li>
</ol>

<p>
所以 S[i+1] = (2^(i+1) - 1) * (A[i+1]-A[i]) + 2*S[i].
</p>

<p>
这个问题朝着O(n)的解法去基本上都能想出来。
</p>

<div class="org-src-container">
<pre class="src src-Python">#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution:
    def sumSubseqWidths(self, A):
        """
        :type A: List[int]
        :rtype: int
        """

        n = len(A)
        A.sort()
        ans = 0
        last = 0
        p2 = 1
        MOD = 10 ** 9 + 7
        for i in range(n - 1):
            p2 = (p2 * 2) % MOD
            now = (p2 - 1) * (A[i + 1] - A[i]) + 2 * last
            now = now % MOD
            ans = (ans + now) % MOD
            last = now
        return ans

</pre>
</div>
</div>
</div>

<div id="outline-container-org5f308b6" class="outline-3">
<h3 id="org5f308b6"><span class="section-number-3">2.4</span> <a href="https://leetcode.com/problems/perfect-squares/description/">279. Perfect Squares @ leetcode</a></h3>
<div class="outline-text-3" id="text-2-4">
<p>
这题可以使用动态规划来解决，空间复杂度是O(n), 时间复杂度是O(n^(3/2)).
</p>

<div class="org-src-container">
<pre class="src src-Python">#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt


class Solution:
    def __init__(self):
        self.dp = [0]

    def numSquares(self, n):
        """
        :type n: int
        :rtype: int
        """

        dp = self.dp
        while len(dp) &lt;= n:
            x = len(dp)
            ans = 1 &lt;&lt; 30
            for p in range(1, x + 1):
                p2 = p ** 2
                if p2 &gt; x:
                    break
                ans = min(ans, dp[x - p2] + 1)
            dp.append(ans)
        return dp[n]

</pre>
</div>

<p>
但是在 <a href="https://leetcode.com/problems/perfect-squares/discuss/180403/C++-O(sqrt(n))-Solution-Using-Legendre's-Three-Square-Theorem-Beats-100">thread</a> 里面给了更加精妙的 <a href="https://en.wikipedia.org/wiki/Legendre's_three-square_theorem">Legendre's three-square theorem</a> 和 <a href="https://en.wikipedia.org/wiki/Lagrange's_four-square_theorem">Lagrange's four-square theorem</a>
空间复杂度是O(1), 时间复杂度是O(sqrt(n)).“所有整数都可以表示成为四个平方数之和”，“所有整数都可以表示成为
三个平方数之和，除非n满足4^a * (8b+7)这样的形式”。数论真的是太神奇了！
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">class</span> <span class="org-type">Solution</span> {
    <span class="org-type">bool</span> <span class="org-function-name">isSquare</span>(<span class="org-type">int</span> <span class="org-variable-name">n</span>) {
        <span class="org-type">int</span> <span class="org-variable-name">sqroot</span> = floor(<span class="org-type">sqrt</span>(<span class="org-variable-name">n</span>));

        <span class="org-keyword">return</span> sqroot * sqroot == n;
    }
<span class="org-keyword">public</span>:
    <span class="org-type">int</span> <span class="org-function-name">numSquares</span>(<span class="org-type">int</span> <span class="org-variable-name">n</span>) {
        <span class="org-keyword">if</span>(isSquare(n))
            <span class="org-keyword">return</span> 1;

        <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 1; i*i &lt; n; i++) {
            <span class="org-keyword">if</span>(isSquare(n - i*i))
                <span class="org-keyword">return</span> 2;
        }

        <span class="org-type">int</span> <span class="org-variable-name">p4</span> = 1;
        <span class="org-keyword">while</span>(n % (4 * p4) == 0)
            p4 *= 4;

        <span class="org-keyword">if</span>((n / p4)%8 == 7)
            <span class="org-keyword">return</span> 4;

        <span class="org-keyword">return</span> 3;
    }
};
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org18bfc84" class="outline-2">
<h2 id="org18bfc84"><span class="section-number-2">3</span> DP</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2ce97b7" class="outline-3">
<h3 id="org2ce97b7"><span class="section-number-3">3.1</span> <a href="https://www.rqnoj.cn/problem/314">NOIP2000方格取数</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://blog.csdn.net/rowanhaoa/article/details/15816067">https://blog.csdn.net/rowanhaoa/article/details/15816067</a>
</p>

<p>
这种动态规划解法还被称为多线程dp. 我理解这里的多线程是指同时考虑两条路径的状态。
</p>

<p>
dp[step][x][y] 表示移动了step步，path1停留在(i, step-i)上，path2停留在(j, step-j)上的路径和。
</p>

<div class="org-src-container">
<pre class="src src-Python">def solve(graph, n):
    inf = 1 &lt;&lt; 30
    neg_inf = -inf

    # for i in range(n):
    #     print(graph[i])

    dp = [[[neg_inf for _ in range(n)] for _ in range(n)] for _ in range(2)]
    now = 0
    dp[now][0][0] = graph[0][0]

    def get_dp(k, i, j):
        if i &lt; 0 or j &lt; 0:
            return neg_inf
        return dp[k][i][j]

    for step in range(1, 2 * n - 1):
        for i in range(n):
            for j in range(n):
                # if 0 &lt;= (step - i) &lt; n and 0 &lt;= (step - j) &lt; n:
                if i &gt; step or j &gt; step: continue
                if (i + n) &lt;= step or (j + n) &lt;= step: continue
                res = max(get_dp(now, i - 1, j), get_dp(now, i, j - 1),
                          get_dp(now, i - 1, j - 1), get_dp(now, i, j))
                res += graph[i][step - i]
                if i != j:
                    res += graph[j][step - j]
                dp[1 - now][i][j] = res
        now = 1 - now

    return dp[now][n - 1][n - 1]
</pre>
</div>
</div>
</div>
