src/competitive-programming-problems.org
** [[https://leetcode.com/problems/maximal-rectangle/description/][Maximal Rectangle @ leetcode]]

在 [[https://leetcode.com/problems/maximal-rectangle/discuss/29054/Share-my-DP-solution][thread]] 下面 @Self_Learner 的注释不错。还有 [[https://leetcode.com/problems/maximal-rectangle/discuss/165472/Largest-Rectangle-Python][thread]] 提出可以使用 "Largest Rectangle in Historgam" 的方法来解决，也非常巧妙。这些算法的时间复杂度都是O(nm)

#+BEGIN_SRC Java
/* we start from the first row, and move downward;
 * height[i] record the current number of countinous '1' in column i;
 * left[i] record the left most index j which satisfies that for any index k from j to  i, height[k] >= height[i];
 * right[i] record the right most index j which satifies that for any index k from i to  j, height[k] >= height[i];
 * by understanding the definition, we can easily figure out we need to update maxArea with value (height[i] * (right[i] - left[i] + 1));
 *
 * Then the question is how to update the array of height, left, and right
 * =================================
 * for updating height, it is easy
 * for (int j = 0; j < n; j++) {
 *    if (matrix[i][j] == '1') height[j]++;
 *    else height[j] = 0;
 * }
 * =============================================================================
 * It is a little bit tricky for initializing and updating left and right array
 * for initialization:
 * we know initially, height array contains all 0, so according to the definition of left and right array,
 * left array should contains all 0, and right array should contain all n - 1
 * for updating left and right, it is kind of tricky to understand...
 *     ==============================================================
 *     Here is the code for updating left array, we scan from left to right
 *     int lB = 0;  //lB is indicating the left boundry for the current row of the matrix (for cells with char "1"), not the height array...
 *     for (int j = 0; j < n; j++) {
 *          if (matrix[i][j] == '1') {
 *              left[j] = Math.max(left[j], lB); // this means the current boundry should satisfy two conditions:
 *              // within the boundry of the previous height array, and within the boundry of the current row...
 *          } else {
 *              left[j] = 0; // when matrix[i][j] = 0, height[j] will get update to 0, so left[j] becomes 0,
 *              // since all height in between 0 - j satisfies the condition of height[k] >= height[j];
 *              lB = j + 1; //and since current position is '0', so the left most boundry for next "1" cell is at least j + 1;
 *          }
 *     }
 *     ==============================================================
 *     the idea for updating the right boundary is similar, we just need to iterate from right to left
 *     int rB = n - 1;
 *     for (int j = n - 1; j >= 0; j--) {
 *         if (matrix[i][j] == '1') {
 *              right[j] = Math.min(right[j], rB);
 *         } else {
 *              right[j] = n - 1;
 *              rB = j - 1;
 *      }
 */
class Solution {
    public int maximalRectangle(char[][] matrix) {
        if (matrix == null || matrix.length == 0 || matrix[0] == null || matrix[0].length == 0) return 0;
        int m = matrix.length, n = matrix[0].length, maxArea = 0;
        int[] left = new int[n];
        int[] right = new int[n];
        int[] height = new int[n];
        Arrays.fill(right, n - 1);
        for (int i = 0; i < m; i++) {
            int rB = n - 1;
            for (int j = n - 1; j >= 0; j--) {
                if (matrix[i][j] == '1') {
                    right[j] = Math.min(right[j], rB);
                } else {
                    right[j] = n - 1;
                    rB = j - 1;
                }
            }
            int lB = 0;
            for (int j = 0; j < n; j++) {
                if (matrix[i][j] == '1') {
                    left[j] = Math.max(left[j], lB);
                    height[j]++;
                    maxArea = Math.max(maxArea, height[j] * (right[j] - left[j] + 1));
                } else {
                    height[j] = 0;
                    left[j] = 0;
                    lB = j + 1;
                }
            }
        }
        return maxArea;
    }
}
#+END_SRC

** [[https://leetcode.com/problems/length-of-longest-fibonacci-subsequence/description/][Length of Longest Fibonacci Subsequence @ leetcode]]

这个可以认为是一类DP问题，通过几个数可以完全确定剩余序列，然后求解满足这种序列的数量。

`dp[x] = dp[y] + 1 if dp[y] == 0 else k` 注意这个代码模式

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt


class Solution:
    def lenLongestFibSubseq(self, A):
        """
        :type A: List[int]
        :rtype: int
        """

        n = len(A)
        indices = {}
        for i in range(n):
            indices[A[i]] = i
        dp = [[0] * n for _ in range(n)]

        ans = 0
        for i in range(n):
            for j in range(i):
                # A[k] + A[j] = A[i]
                k = indices.get(A[i] - A[j])
                if k is not None and k < j:
                    dp[i][j] = dp[j][k] + 1 if dp[j][k] != 0 else 3
                    ans = max(ans, dp[i][j])
        return ans

#+END_SRC

** [[https://leetcode.com/problems/number-of-subarrays-with-bounded-maximum/description/][Number of Subarrays with Bounded Maximum]]

这题的动态规划很有意思
1. back[i+1]=j 表示截止到A[i], 那么A[j..i]所有的值都是在[L,R]之间的
2. dp[i+1] 则表示包含A[i]的话，有多少种组合

这里需要计算back的原因是，如果A[i]<L的话，那么只能使用之前的组合。
但是如果A[i]在[L,R]范围的话，那么实际选择是有i-back[i]+1中选择的

#+BEGIN_SRC Python
class Solution:
    def numSubarrayBoundedMax(self, A, L, R):
        """
        :type A: List[int]
        :type L: int
        :type R: int
        :rtype: int
        """

        n = len(A)
        back = [0] * (n + 1)
        dp = [0] * (n + 1)
        for i in range(n):
            if A[i] > R:
                back[i + 1] = i + 1
                dp[i + 1] = 0
            else:
                back[i + 1] = min(i + 1, back[i])
                if A[i] < L:
                    dp[i + 1] = dp[i]
                else:
                    dp[i + 1] = (i - back[i] + 1)
        # print(dp[1:], back[1:])
        ans = 0
        for i in range(n):
            ans += dp[i + 1]
        return ans
#+END_SRC

