src/competitive-programming-problems.org
** [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock-with-transaction-fee/description/][714. Best Time to Buy and Sell Stock with Transaction Fee @ leetcode]]

这题目从数量级看应该是需要O(n)的解法。我最开始的想法是使用启发式方法：
1. 把所有的上涨列举出来
2. 遍历所有上涨，合并可能的上涨
这个方法对 [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock-ii][122. Best Time to Buy and Sell Stock II]] 是可以work的，但是用在本题上找不到最优解。
方法可以看 [[file:codes/contest/leetcode/best-time-to-buy-and-sell-stock-with-transaction-fee.py][code on github]] 里面的 `maxProfitWA`

假设我们允许O(n^2)的DP解法的话，实现可以是这样的
#+BEGIN_SRC Python
    def maxProfitNaive(self, prices, fee):
        """
        :type prices: List[int]
        :type fee: int
        :rtype: int
        """

        n = len(prices)
        dp = [0] * n
        for i in range(1, n):
            min_value = prices[i]
            profit = 0
            for j in range(i - 1, -1, -1):
                min_value = min(min_value, prices[j])
                profit = max(profit, dp[j] + (prices[i] - min_value - fee))
            dp[i] = profit
        return max(dp)
#+END_SRC

代码上看 `min_value` 和 `dp[j]` 是可以放在一起的，我们不用去查找这两个对的所有可能值，
只需要保存 `max(dp[j] - min_value)` 即可。所以我们将代码改写成为下面这样，时间复杂度
也可以降低到O(n), 空间复杂度是O(1).

#+BEGIN_SRC Python
    def maxProfit(self, prices, fee):
        """
        :type prices: List[int]
        :type fee: int
        :rtype: int
        """

        n = len(prices)
        ans = 0
        cost = -prices[0]
        for i in range(1, n):
            res = prices[i] - fee + cost
            if res > ans:
                ans = res
            cost = max(cost, ans - prices[i])
        return ans
#+END_SRC

** [[https://leetcode.com/problems/maximum-sum-of-3-non-overlapping-subarrays/description/][689. Maximum Sum of 3 Non-Overlapping Subarrays]]

1. 通过枚举得到所有长度为k的subarray(k-subarry)的和，对应代码里面的 `acc`
2. 遍历计算 `left`和`right`. `left[i]` 表示 `nums[..i]` 中最大 k-subarray 之和，而lidx[i]表示对应的下标。
3. 枚举中间所有可能的位置。这个方法其实可以推广到4个或者是多个non-overlapping subarrays.

如果是k non-overlapping subarrays的话，时间复杂度是O(n^(k-2)). 所以这题时间复杂度是O(n)

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt


class Solution:
    def maxSumOfThreeSubarrays(self, nums, k):
        """
        :type nums: List[int]
        :type k: int
        :rtype: List[int]
        """
        acc = []
        value = sum(nums[:k])
        acc.append(value)
        for i in range(k, len(nums)):
            value -= nums[i - k]
            value += nums[i]
            acc.append(value)

        n = len(acc)
        left = [0] * n
        lidx = [-1] * n
        left[0] = acc[0]
        lidx[0] = 0
        for i in range(1, n):
            if acc[i] > left[i - 1]:
                lidx[i] = i
                left[i] = acc[i]
            else:
                lidx[i] = lidx[i - 1]
                left[i] = left[i - 1]

        right = [0] * n
        ridx = [-1] * n
        right[n - 1] = acc[n - 1]
        ridx[n - 1] = n - 1
        for i in range(n - 2, -1, -1):
            if acc[i] > right[i + 1]:
                ridx[i] = i
                right[i] = acc[i]
            else:
                ridx[i] = ridx[i + 1]
                right[i] = right[i + 1]

        res = 0
        items = []
        for i in range(k, n - k):
            value = left[i - k] + acc[i] + right[i + k]
            if value > res:
                res = value
                items = [lidx[i - k], i, ridx[i + k]]
        return items

#+END_SRC

** [[https://leetcode.com/problems/interleaving-string/description/][97. Interleaving String]]

这题目的状态转移方程不是很难，时间复杂度是O((n+m) * min(n,m))，
空间复杂度上可以使用滚动数组的方式减少到O(min(n,m)). 为了可以减少到O(min(n,m)),
我们需要在最开始判断一下哪个字符串比较短。

#+BEGIN_SRC Python
class Solution:
    def isInterleave(self, s1, s2, s3):
        """
        :type s1: str
        :type s2: str
        :type s3: str
        :rtype: bool
        """

        n = len(s1)
        m = len(s2)
        if n > m:
            n, m = m, n
            s1, s2 = s2, s1
        if (n + m) != len(s3):
            return False
        dp = [[0] * (n + 1) for _ in range(2)]
        now = 0
        dp[now][0] = 1
        for i in range(n + m):
            for j in range(n + 1):
                val = 0
                if (0 <= (j - 1) < n) and s1[j - 1] == s3[i]:
                    val = max(val, dp[now][j - 1])
                if (0 <= (i - j) < m) and s2[i - j] == s3[i]:
                    val = max(val, dp[now][j])
                dp[1 - now][j] = val
            now = 1 - now
        return bool(dp[now][n])


#+END_SRC

** [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock-iii/description/][123. Best Time to Buy and Sell Stock III]]

如果这题限制最多只允许一次交易的话就变成了 [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock/description/][121. Best Time to Buy and Sell Stock]].
这个题目也可以使用DP方法求解，但是只需要O(1)的空间复杂度。我们可以在这题目的基础上，
预处理得到数组st. st[i]表示从i之后进行交易的话最大的profit是多少。然后在遍历的时候，
`max_profit_now + st[i]` 就是如果i点进行一次卖出的话，整个过程最多可以获得的profit.

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

class Solution(object):
    def maxProfit(self, prices):
        """
        :type prices: List[int]
        :rtype: int
        """

        if not prices: return 0

        n = len(prices)
        st = [0] * n

        # st[i]: 从i开始往后交易最多的profit
        max_sell = prices[-1]
        max_profit = 0
        for i in reversed(range(n)):
            max_sell = max(max_sell, prices[i])
            max_profit = max(max_profit, max_sell - prices[i])
            st[i] = max_profit

        ans = 0
        min_buy = prices[0]
        max_profit = 0
        for i in range(n):
            min_buy = min(min_buy, prices[i])
            max_profit = max(max_profit, prices[i] - min_buy)
            ans = max(ans, max_profit + st[i])

        return ans
#+END_SRC

* BS
** [[https://leetcode.com/problems/find-the-duplicate-number/description/][Find the Duplicate Number @ leetcode]]

对目标值进行二分搜索，如果这个值x出现次数多余1那么就是这个值，如果小于这个值的个数超过(x-1)那么说明目标值比x小

#+BEGIN_SRC Python
#!/usr/bin/env python
# coding:utf-8
# Copyright (C) dirlt

# NOTE(yan): 很有意思的一道题目

class Solution:
    def findDuplicate(self, nums):
        """
        :type nums: List[int]
        :rtype: int
        """

        n = len(nums)

        def check(x):
            low, high, eq = 0, 0, 0
            for v in nums:
                if v < x:
                    low += 1
                elif v == x:
                    eq += 1
                elif v > x:
                    high += 1
            if eq >= 2:
                return 0
            elif low > (x - 1):
                return -1
            else:
                return 1

        s, e = 1, n - 1
        while s < e:
            m = (s + e) // 2
            res = check(m)
            if res == 0:
                return m
            elif res == -1:
                e = m - 1
            else:
                s = m + 1
        return s

#+END_SRC

